/************************************************************************************************
                                    实 验 二

    从键盘上输入一个长整型数，判断该长整型数的高16位所表示的有符号数及低16位所表示的有符号数的奇偶性，并将最高8位与最低8位、次高8位与次低8位交换，以十六进制形式输出交换后的结果。

   [提示：利用位运算符来实现，包括：按位与&、左移<<、右移>>等位运算。]

   [例如：长整型数0X12345678,高16位数为0X1234，低16位数为0X5678,交换后的数为0X78563412]

************************************************************************************************/
#include<stdio.h>

int main(){
    long n = 0, high = 0, low = 0, change = 0;
    int flag1 = 0, flag2 = 0;

    scanf("%lx",&n);
    printf("n: %#lx\n",n);

    high = (n>>16) & 0x0000ffff;
    low = n & 0x0000ffff;
    
    flag1 = (high%2)? 1: 0;
    flag2 = (low%2)? 1: 0;

    printf("0为偶数，1为奇数\n") ;
    printf("high: %#lx ------%d\nlow: %#lx------%d\n",high,flag1,low,flag2);

    change = ((n&0x00ff0000)>>8) + ((n&0x0000ff00)<<8) + ((n&0x000000ff)<<24) + ((n&0xff000000)>>24);
    printf("after change:%#lx\n", change);

    return 0;
}
