/************************************************************************************************
                    实 验 三

    从键盘上输入一个5位整数，判断该整数是否为回文数。

  ************************************************************************************************/
  #include<stdio.h>
  int main(void){
    int n, m = 0, r, s;
    printf("input: "); scanf("%d", &n);

    if(n < 9999 || n > 99999){
      printf("Fuck, plz type in the real number.\n");
    }
    else
      s = n;
      while (s != 0) {
        r = s % 10;
        m = m * 10 + r;
        s = s / 10;
      }
      if(m == n)
        printf("yep");
      else
        printf("nope");
  }

/*

12321
s = 12321 != 0;
r = 1;
m = 1;
s = 1232;

r = 2;
m = 10 + 2 = 12;
s = 123;

r = 3;
m = 123;
s = 12;

r = 2;
m = 1232;
s = 1;

r = 1;
m = 12321;
s = 0;


*/
