/************************************************************************************************
                      实 验 五

    任何一个自然数m的立方均可写成m个连续奇数之和。
      例如：
　      1^3 = 1
　      2^3 = 3+5
　      3^3 = 7+9+11
　      4^3 = 13+15+17+19

    编程实现：输入一自然数n，求组成n3的n个连续奇数。

   〖实验提示〗
      使用双重循环，满足条件时用break退出。

***********************************************************************************************/
#include<stdio.h>
int main () {
    int n, i, j, a[50], sum = 0, k, temp ;
    scanf("%d", &n) ;
    k = n * n * n;
    for(i = 1; ; i = i + 2){
        sum = 0 ;
        for(j = i; j < i + n * 2;j = j + 2){
            sum += j ;
        }
        if(sum  == k){
            temp = i;
            for(i = 0 ;i < n ;i++){
                printf("%d ", temp);
                temp += 2 ;
            }
            printf("\n") ;
            return 0 ;
        }
    }
}
