/************************************************************************************************
                                    实 验 七

  编写一个程序，其功能是将用户输入的一段英文（注意包含空格、逗号、句号及英文字母）分离出单词，并以每个单词出现的次数从高到低输出单词及其次数，次数相同的单词以其对应字符串大小升序输出。
例如：Green is on the left，Red is on the Right，the right is afraid of water, the left is afraid of insects.
输出：is(4)  the(4)  afraid(2)  left(2)  of(2)  on(2)  right(2) Green(1)  insects(1)  Red(1)  water(1)

[提示:
 (1) 建立一函数用于接收输入的英文段落。
 (2) 建立字符串数组用于保存每次分离出的单词，及出现的次数(编一函数) 。
 (3) 对字符串数组按规定进行排序(编一函数)]

************************************************************************************************/
