/************************************************************************************************
                                    实 验 九

  在字符串处理中，常常需要实现取子串、插入、删除这三种操作，编译程序了来实现这三种操作。问题描述如下：
  （1）取子串操作：输入字符串、起始位置、子串长度，输出子串的内容。
  （2）插入操作：输入源字符串、目标字符串、指定位置，把源字符串插入到目标字符串的指定位置前，并输出插入后的目标字符串。
  （3）删除操作：输入字符串、待删除子串的起始位置和长度，从字符串中删除待删除子串，并输出删除后的字符串。
  程序运行时先给出一个菜单，由使用者输入想进行的操作及实现该项操作所需要的参数。输入完毕后，由程序给出操作后的结果。

************************************************************************************************/
